using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
            Розробити програму, що моделює танковий бій. 
            
            У танковому бою беруть участь 5 танків «Т-34» і 5 танків «Pantera». 
            Кожен танк ( «Т-34» і «Pantera») описуються параметрами: «Боєкомплект», «Рівень броні», «Рівень маневреності». 
            Значення даних параметрів задаються випадковими числами від 0 до 100. 
            Кожен танк бере участь в парній битві, тобто перший танк «Т-34» бореться з першим танком «Pantera» і т.д.
            Перемога присуджується тому танку, який перевищує противника за двома і більше параметрами з трьох.
*/
namespace _06.Task_tank
{
    class Program
    {
        static void Main(string[] args)
        {
            Tank tank;
            tank.ShowInfo();
        }
    }
}
