using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
    Розробити гру "Гонки" з використанням делегатів. 

    В грі використати кілька класів автомобілів (спортивні, легкові, грузові і автобуси). 
    Розробити методи і властивості для кожного з оголошених класів. 
    Реалізувати гру у вигляді класу, який за допомогою делегатів управляє автомобілями в процесі гри. 
    Рекомендації по виконанню роботи: 

    Розробити віртуальний клас "Car" (Автомобіль). Можна скористатись вже розробленим раніше в уроці 6, тільки допрацювати його. 

    В даному класі зібрати всі спільні поля, властивості, методи, наприклад, максимальна швидкість, «збільшити швидкість», «зменшити швидкість». 
    Розробити класи автомобілів з конкретною реалізацією конструкторів і методів. 
    
    Створити делегат, який працює з об'єктами створених конкретних класів автомобилів і додати події в класи автомобилів. 
    Клас гри повинен випадковим чином генерувати склад машин, які приймають участь в гонці і за допомогою розроблених делегатів управляти їх параметрами (випадковим чином), 
    наприклад, впливати на швидкість руху. 
    Гра закінчується, коли якийсь з автомобилів проїхав певну відстань (реалізувати за допомогою подій). 

*/

namespace _04.home_work_03._19._20_
{
    class Program
    {

        static Game game;

        static void Main(string[] args)
        {
            game = new Game();

            game.Finish_event += Winner;

            game.Start_game();

            game.Show_all_car();

            game.Go();
        }

        static private void Winner()
        {
            game.End();
        }

        
    }
}
