using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
 * Написати XML документ для збереження даних про рецепти, тобто книгу рецептів. Кожен рецепт (recipe) буде мати наступну структуру, тобто зберігати дані про:	
    назва (title) – назва рецепту;
	фото (photo)  – необов’язковий пустий елемент, який містить фото блюда;

	інгридієнти (ingredients):    
        інгридієнт (item)                – назва інгридієнту;
		    кількість (quantity)         – необхідна кількість;	

	приготування (preparation)   – власне сам рецепт;
	порції (serving)             – вихід;
	калорійність (energy)        – необов’язковий елемент, що містить інформацію про калорійність блюда:	
                        білки (proteins);
		                жири (fats);
		                вуглеводи (carbs).	
	

Варто відмітити, що інгридієнтів при приготуванні може бути більше одного, а дочірні елементи в елементі energy (якщо він присутній) можуть розміщуватись в будь-якому порядку. 
Крім того, ряд елементів можуть мати додаткові властивості, які в XML-документі відображаються за допомогою атрибутів:
батьківський елемент кожного окремого рецепту (recipe) обов’язково буде мати ідентифікатор;
	елемент photo має обов'язковий атрибут href, який містить шлях до зображення;
	елемент quantity містить обов’язково інформацію про одиницю виміру (грами, літри, ст.ложка тощо);
	елемент preparation може містити дані (по бажанню, тобто необов'язкові атрибути) про:
	
ступінь складності, який може містити одне з наступних значень:
            для початківців;
			для досвідчених;
			для майстрів.
		
		По замовчуванню приймається “для початківців”.
		час приготування;
		додаткові характеристики з можливими значеннями:
            для вегетаріанців;
			для діабетиків;
			низькокалорійно;
			можна заморожувати.
ПРИМІТКА! Рецептів в документі має бути мінімум 3 шт. Спробувати різні варіації опису рецептів: з використанням всіх можливих атрибутів i елементів та з відсутністю необов'язкових.


 */

namespace _20.ClassWork.Task_xml
{
    class Program
    {
        static void Main(string[] args)
        {
            foreach (var item in Recipe.GetRecipe())
            {
                Console.WriteLine($"\n\n Title     : {item.Title}\n\t Ingradient 1 : {item.Ingredients[0]}\n\t Ingradient 2 : {item.Ingredients[1]}\n" +
                    $"\t Ingradient 3 : {item.Ingredients[2]}\n Preparati : {item.Preparati}\n Serving   : {item.Serving}\n Energy    :\n\t proteins->{item.Energy[0]}\n\t fats->{item.Energy[1]}\n\t carbs->{item.Energy[2]}");
            }
        }
    }
}
